tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
    if ((uint32_t)(now - s_lcd_scope_last_ms) >= LCD_SCOPE_FRAME_MS) {
        if ((s_lcd_scope_last_ms == 0U) ||
            ((uint32_t)(now - s_lcd_scope_last_ms) >
                 (3U * LCD_SCOPE_FRAME_MS))) {
            s_lcd_scope_last_ms = now;
        } else {
            s_lcd_scope_last_ms += LCD_SCOPE_FRAME_MS;
        }
        if (s_lcd_scope_view == LCD_SCOPE_VIEW_IQ) {
            const float *magnitudes;
            float ref_peak;
            int32_t shift_bins;
            const int16_t *i_samples;
            const int16_t *q_samples;
            size_t iq_n;
            uint32_t fft_t0 = (uint32_t)mp_hal_ticks_us();
            bool ready = ra_iq_adc_spectrum_frame(&magnitudes, &ref_peak, &shift_bins,
                &i_samples, &q_samples, &iq_n);
            uint32_t fft_elapsed = (uint32_t)mp_hal_ticks_us() - fft_t0;
            if (ready) {
                s_lcd_fft_last_us = fft_elapsed;
                if (fft_elapsed > s_lcd_fft_max_us) {
                    s_lcd_fft_max_us = fft_elapsed;
                }
                /* The constellation consumes a fresh frame at 30 Hz, but the left
                 * spectrum keeps the proven 10-Hz shared smoother/cadence. */
                if ((uint32_t)(now - s_lcd_spectrum_last_fft_ms) >=
                    LCD_SPECTRUM_FRAME_MS) {
                    if ((s_lcd_spectrum_last_fft_ms == 0U) ||
                        ((uint32_t)(now - s_lcd_spectrum_last_fft_ms) >
                         (3U * LCD_SPECTRUM_FRAME_MS))) {
                        s_lcd_spectrum_last_fft_ms = now;
                    } else {
                        s_lcd_spectrum_last_fft_ms += LCD_SPECTRUM_FRAME_MS;
                    }
                    lcd_spectrum_targets_from_frame(magnitudes, ref_peak, shift_bins);
                }
                lcd_constellation_write(i_samples, q_samples, iq_n);
            }
        } else {
            const int16_t *samples;
            size_t sample_count;
            if (ra_iq_adc_scope_frame(&samples, &sample_count)) {
                lcd_scope_write(samples, sample_count);
            }
        }
    }

    if ((s_lcd_scope_view == LCD_SCOPE_VIEW_TIME) &&
        ((uint32_t)(now - s_lcd_spectrum_last_fft_ms) >= LCD_SPECTRUM_FRAME_MS)) {
        if ((s_lcd_spectrum_last_fft_ms == 0U) ||
            ((uint32_t)(now - s_lcd_spectrum_last_fft_ms) >
             (3U * LCD_SPECTRUM_FRAME_MS))) {
            s_lcd_spectrum_last_fft_ms = now;
        } else {
            s_lcd_spectrum_last_fft_ms += LCD_SPECTRUM_FRAME_MS;
        }
        if (ra_iq_adc_spectrum_bars(s_lcd_spectrum_target, LCD_SPECTRUM_BARS,
            LCD_SPECTRUM_MAX_H_PX)) {
            s_lcd_spectrum_target_valid = 1U;
        }
    }
    #endif

    if (!s_lcd_spectrum_target_valid ||
        ((uint32_t)(now - s_lcd_spectrum_last_phase_ms) < LCD_SPECTRUM_PHASE_MS)) {
        return;
    }
    if ((s_lcd_spectrum_last_phase_ms == 0U) ||
        ((uint32_t)(now - s_lcd_spectrum_last_phase_ms) >
         (3U * LCD_SPECTRUM_PHASE_MS))) {
        s_lcd_spectrum_last_phase_ms = now;
    } else {
        s_lcd_spectrum_last_phase_ms += LCD_SPECTRUM_PHASE_MS;
    }

    uint32_t changed = 0U;

    for (uint32_t i = s_lcd_spectrum_phase; i < LCD_SPECTRUM_BARS;
         i += LCD_SPECTRUM_PHASES) {
        int16_t old_h = s_lcd_spectrum_h[i];
        int16_t new_h = s_lcd_spectrum_target[i];
        if (old_h == new_h) {
            continue;
        }
        s_lcd_spectrum_h[i] = new_h;
        changed++;
    }

    s_lcd_spectrum_phase++;
    if (s_lcd_spectrum_phase >= LCD_SPECTRUM_PHASES) {
        s_lcd_spectrum_phase = 0U;
    }
    if (changed != 0U) {
        s_lcd_spectrum_valid = 1U;
    }
}

static void lcd_lv_spectrum_event_cb(lv_event_t *e) {
    lv_event_code_t code = lv_event_get_code(e);
    lv_obj_t *obj = lv_event_get_target_obj(e);
    if (code == LV_EVENT_DELETE) {
        if (obj == s_lcd_spectrum_obj) {
            s_lcd_spectrum_obj = NULL;
            s_lcd_spectrum_valid = 0U;
            s_lcd_spectrum_target_valid = 0U;
            #if defined(MICROPY_HW_ENABLE_IQ_ADC) && (MICROPY_HW_ENABLE_IQ_ADC == 1)
            ra_iq_adc_spectrum_enable(0U);
            #endif
            if (s_lcd_spectrum_timer != NULL) {
                lv_timer_delete(s_lcd_spectrum_timer);
                s_lcd_spectrum_timer = NULL;
            }
        }
        return;
    }
    if ((code != LV_EVENT_DRAW_MAIN) || (obj != s_lcd_spectrum_obj)) {
        return;
    }

    if (s_lcd_spectrum_view == LCD_VIEW_WATERFALL) {
        /* The framebuffer itself is the waterfall history. Routine LVGL redraws
         * can reach this transparent object, so never clear the full native area
         * here. True ownership changes request an explicit reset elsewhere. */
        return;
    }

    lv_layer_t *layer = lv_event_get_layer(e);
    lv_area_t obj_area;
    lv_area_t plot_area;
    lv_obj_get_coords(obj, &obj_area);
    lcd_lv_spectrum_plot_area(&obj_area, &plot_area);

    lv_draw_rect_dsc_t rect;
    lv_draw_rect_dsc_init(&rect);
    rect.bg_opa = LV_OPA_COVER;
    rect.border_opa = LV_OPA_TRANSP;
    rect.radius = 0;

    /* A height change invalidates only the vertical delta.  A growing delta is
     * completely covered by its new bar and therefore needs no background clear;
     * a shrinking delta no longer intersects the new bar and needs only the clear.
     * Full/foreign invalidations still take the normal background + bars path. */
    bool clip_inside_bar = false;
    for (uint32_t i = 0U; i < LCD_SPECTRUM_BARS; ++i) {
        lv_area_t bar_area;
        lcd_lv_spectrum_bar_area(&plot_area, i, s_lcd_spectrum_h[i], &bar_area);
        if ((layer->_clip_area.x1 >= bar_area.x1) &&
            (layer->_clip_area.x2 <= bar_area.x2) &&
            (layer->_clip_area.y1 >= bar_area.y1) &&
            (layer->_clip_area.y2 <= bar_area.y2)) {
            clip_inside_bar = true;
            break;
        }
    }
    if (!clip_inside_bar) {
        rect.bg_color = s_lcd_spectrum_bg;
        /* This LVGL callback owns only the left plot.  The right TIME/I-Q panel is
         * a separate native framebuffer surface and must survive foreign/full SPEC
         * invalidations until its next live frame. */
        lv_draw_rect(layer, &rect, &plot_area);
    }

    for (uint32_t i = 0U; i < LCD_SPECTRUM_BARS; ++i) {
        lv_area_t bar_area;
        lcd_lv_spectrum_bar_area(&plot_area, i, s_lcd_spectrum_h[i], &bar_area);
        if ((bar_area.x2 < layer->_clip_area.x1) ||
            (bar_area.x1 > layer->_clip_area.x2) ||
            (bar_area.y2 < layer->_clip_area.y1) ||
            (bar_area.y1 > layer->_clip_area.y2)) {
            continue;
        }
        rect.bg_color = (i == (LCD_SPECTRUM_BARS / 2U)) ?
            s_lcd_spectrum_center : s_lcd_spectrum_bar;
        lv_draw_rect(layer, &rect, &bar_area);
    }
    s_lcd_spectrum_valid = 1U;
}

static lv_obj_t *lcd_lv_obj_from_mp(mp_obj_t obj_in) {
    mp_buffer_info_t bi;
    mp_get_buffer_raise(obj_in, &bi, MP_BUFFER_READ);
    if (bi.len != sizeof(lv_obj_t *)) {
        mp_raise_ValueError(MP_ERROR_TEXT("expected LVGL object"));
    }
    lv_obj_t *obj = NULL;
    memcpy(&obj, bi.buf, sizeof(obj));
    if ((obj == NULL) || !lv_obj_is_valid(obj)) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid LVGL object"));
    }
    return obj;
}

