tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
// spectrum_attach(obj[, bg_rgb, bar_rgb, center_rgb]) -> bool
// Attach the single native spectrum surface and delete the legacy bar children.
STATIC mp_obj_t lcd_spectrum_attach(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    if (!lv_is_initialized()) {
        return mp_const_false;
    }
    lv_obj_t *obj = lcd_lv_obj_from_mp(args[1]);
    uint32_t bg = (n_args > 2U) ? (uint32_t)mp_obj_get_int(args[2]) : 0xFFFFFFU;
    uint32_t bar = (n_args > 3U) ? (uint32_t)mp_obj_get_int(args[3]) : 0xB6BDC6U;
    uint32_t center = (n_args > 4U) ? (uint32_t)mp_obj_get_int(args[4]) : 0x0097A7U;

    s_lcd_spectrum_bg = lv_color_hex(bg & 0xFFFFFFU);
    s_lcd_spectrum_bar = lv_color_hex(bar & 0xFFFFFFU);
    s_lcd_spectrum_center = lv_color_hex(center & 0xFFFFFFU);

    if (s_lcd_spectrum_obj != obj) {
        lv_timer_t *new_timer = lv_timer_create(lcd_lv_spectrum_timer_cb,
            LCD_SPECTRUM_TICK_MS, NULL);
        if (new_timer == NULL) {
            return mp_const_false;
        }
        if ((s_lcd_spectrum_obj != NULL) && lv_obj_is_valid(s_lcd_spectrum_obj)) {
            (void)lv_obj_remove_event_cb(s_lcd_spectrum_obj, lcd_lv_spectrum_event_cb);
        }
        lv_obj_clean(obj);
        memset(s_lcd_spectrum_h, 0, sizeof(s_lcd_spectrum_h));
        memset(s_lcd_spectrum_target, 0, sizeof(s_lcd_spectrum_target));
        s_lcd_spectrum_valid = 0U;
        s_lcd_spectrum_target_valid = 0U;
        s_lcd_spectrum_phase = 0U;
        s_lcd_spectrum_view = LCD_VIEW_SPECTRUM;
        s_lcd_spectrum_paused = 0U;
        s_lcd_waterfall_reset = 1U;
        s_lcd_spectrum_last_fft_ms = (uint32_t)mp_hal_ticks_ms();
        s_lcd_spectrum_last_phase_ms = s_lcd_spectrum_last_fft_ms;
        s_lcd_waterfall_rows = 0U;
        s_lcd_waterfall_last_us = 0U;
        s_lcd_waterfall_max_us = 0U;
        s_lcd_fft_last_us = 0U;
        s_lcd_fft_max_us = 0U;
        s_lcd_scope_peak = 32;
        s_lcd_const_peak = 32;
        s_lcd_scope_view = LCD_SCOPE_VIEW_TIME;
        s_lcd_scope_last_ms = s_lcd_spectrum_last_fft_ms;
        s_lcd_spectrum_obj = obj;
        lv_obj_add_event_cb(obj, lcd_lv_spectrum_event_cb, LV_EVENT_DRAW_MAIN, NULL);
        lv_obj_add_event_cb(obj, lcd_lv_spectrum_event_cb, LV_EVENT_DELETE, NULL);
        if (s_lcd_spectrum_timer != NULL) {
            lv_timer_delete(s_lcd_spectrum_timer);
        }
        s_lcd_spectrum_timer = new_timer;
        #if defined(MICROPY_HW_ENABLE_IQ_ADC) && (MICROPY_HW_ENABLE_IQ_ADC == 1)
        ra_iq_adc_spectrum_enable(1U);
        ra_iq_adc_scope_enable(1U);
        #endif
    }
    lv_obj_invalidate(obj);
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_spectrum_attach_obj, 2, 5,
    lcd_spectrum_attach);

// spectrum_update(array('h', 27)) -> number of changed targets, or False if detached.
// This only publishes the newest FFT targets.  The 20 ms C timer commits five
// interleaved groups on separate physical frames and queues narrow per-bar dirty
// strips; the native draw callback then paints through the normal VSYNC-gated path.
STATIC mp_obj_t lcd_spectrum_update(mp_obj_t self_in, mp_obj_t buf_in) {
    (void)self_in;
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj)) {
        s_lcd_spectrum_obj = NULL;
        s_lcd_spectrum_valid = 0U;
        s_lcd_spectrum_target_valid = 0U;
        return mp_const_false;
    }
    if (s_lcd_spectrum_view != LCD_VIEW_SPECTRUM) {
        return MP_OBJ_NEW_SMALL_INT(0);
    }

    mp_buffer_info_t bi;
    mp_get_buffer_raise(buf_in, &bi, MP_BUFFER_READ);
    if ((bi.typecode != 'h') || (bi.len < LCD_SPECTRUM_BARS * sizeof(int16_t))) {
        mp_raise_ValueError(MP_ERROR_TEXT("buf must be array('h', >=27)"));
    }
    const int16_t *src = (const int16_t *)bi.buf;

    uint32_t changed = 0U;
    for (uint32_t i = 0U; i < LCD_SPECTRUM_BARS; ++i) {
        int16_t h = src[i];
        if (h < 2) {
            h = 2;
        } else if (h > LCD_SPECTRUM_MAX_H_PX) {
            h = LCD_SPECTRUM_MAX_H_PX;
        }
        if (!s_lcd_spectrum_target_valid || (h != s_lcd_spectrum_target[i])) {
            s_lcd_spectrum_target[i] = h;
            changed++;
        }
    }
    s_lcd_spectrum_target_valid = 1U;
    return MP_OBJ_NEW_SMALL_INT((mp_int_t)changed);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(machine_lcd_spectrum_update_obj, lcd_spectrum_update);

// spectrum([view]) -- left view 0 = bars, 1 = waterfall; DAC scope stays at right.
// With no argument return:
// (view, direct_rows, last_write_us, max_write_us, last_fft_us, max_fft_us).
STATIC mp_obj_t lcd_spectrum(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    if (n_args == 1U) {
        mp_obj_t t[6] = {
            MP_OBJ_NEW_SMALL_INT(s_lcd_spectrum_view),
            mp_obj_new_int_from_uint(s_lcd_waterfall_rows),
            mp_obj_new_int_from_uint(s_lcd_waterfall_last_us),
            mp_obj_new_int_from_uint(s_lcd_waterfall_max_us),
            mp_obj_new_int_from_uint(s_lcd_fft_last_us),
            mp_obj_new_int_from_uint(s_lcd_fft_max_us),
        };
        return mp_obj_new_tuple(MP_ARRAY_SIZE(t), t);
    }

    mp_int_t view = mp_obj_get_int(args[1]);
    if ((view != (mp_int_t)LCD_VIEW_SPECTRUM) &&
        (view != (mp_int_t)LCD_VIEW_WATERFALL)) {
        mp_raise_ValueError(MP_ERROR_TEXT("view must be 0 or 1"));
    }
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj)) {
        return mp_const_false;
    }
    if ((uint8_t)view != s_lcd_spectrum_view) {
        s_lcd_spectrum_view = (uint8_t)view;
        s_lcd_spectrum_valid = 0U;
        s_lcd_waterfall_reset = 1U;
        s_lcd_spectrum_last_fft_ms = 0U;
        s_lcd_spectrum_last_phase_ms = 0U;
        s_lcd_scope_last_ms = 0U;
        s_lcd_scope_peak = 32;
        s_lcd_const_peak = 32;
        s_lcd_waterfall_rows = 0U;
        s_lcd_waterfall_last_us = 0U;
        s_lcd_waterfall_max_us = 0U;
        s_lcd_fft_last_us = 0U;
        s_lcd_fft_max_us = 0U;
        lv_obj_invalidate(s_lcd_spectrum_obj);
    }
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_spectrum_obj, 1, 2,
    lcd_spectrum);

// scope_view([view]) -- right native panel: 0 = played DAC time trace,
// 1 = I/Q constellation from the same completed complex frame used by the FFT.
STATIC mp_obj_t lcd_scope_view(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    if (n_args == 1U) {
        return MP_OBJ_NEW_SMALL_INT(s_lcd_scope_view);
    }
    mp_int_t view = mp_obj_get_int(args[1]);
    if ((view != (mp_int_t)LCD_SCOPE_VIEW_TIME) &&
        (view != (mp_int_t)LCD_SCOPE_VIEW_IQ)) {
        mp_raise_ValueError(MP_ERROR_TEXT("view must be 0 or 1"));
    }
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj)) {
        return mp_const_false;
    }
    if ((uint8_t)view != s_lcd_scope_view) {
        s_lcd_scope_view = (uint8_t)view;
        s_lcd_scope_last_ms = 0U;
        s_lcd_scope_peak = 32;
        s_lcd_const_peak = 32;
        /* Do not invalidate the whole transparent native object here: in WF mode
         * its framebuffer pixels are the retained history.  The next 33-ms native
         * transaction clears and rebuilds only the right panel. */
    }
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_scope_view_obj, 1, 2,
    lcd_scope_view);

// spectrum_pause([pause]) -- stop direct framebuffer writes while a same-screen
// modal overlay covers the receiver.  Inactive full screens are rejected by the
// C timer independently, so this flag is only needed for overlays on HOME itself.
STATIC mp_obj_t lcd_spectrum_pause(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    if (n_args == 1U) {
        return mp_obj_new_bool(s_lcd_spectrum_paused != 0U);
    }

