tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
    uint8_t paused = mp_obj_is_true(args[1]) ? 1U : 0U;
    if (paused != s_lcd_spectrum_paused) {
        s_lcd_spectrum_paused = paused;
        if (!paused && (s_lcd_spectrum_obj != NULL) &&
            lv_obj_is_valid(s_lcd_spectrum_obj)) {
            /* The overlay/full-screen redraw owns these framebuffer pixels while
             * paused.  Rebuild the whole native surface on the first HOME frame. */
            s_lcd_waterfall_reset = 1U;
            s_lcd_spectrum_last_fft_ms = 0U;
            s_lcd_spectrum_last_phase_ms = 0U;
            s_lcd_scope_last_ms = 0U;
            lv_obj_invalidate(s_lcd_spectrum_obj);
        }
    }
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_spectrum_pause_obj, 1, 2,
    lcd_spectrum_pause);

// scroll_rect(x, y, w, h, dy) -> bool
// Stage one overlap-safe RGB565 move for the next LVGL render-start transaction.
// Positive dy moves the existing pixels down; negative dy moves them up.
STATIC mp_obj_t lcd_scroll_rect(size_t n_args, const mp_obj_t *args) {
    (void)n_args;
    machine_lcd_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    int32_t x = (int32_t)mp_obj_get_int(args[1]);
    int32_t y = (int32_t)mp_obj_get_int(args[2]);
    int32_t w = (int32_t)mp_obj_get_int(args[3]);
    int32_t h = (int32_t)mp_obj_get_int(args[4]);
    int32_t dy = (int32_t)mp_obj_get_int(args[5]);
    uint32_t screen_w = g_display0_cfg.input[0].hsize;
    uint32_t screen_h = g_display0_cfg.input[0].vsize;

    if (!self->isinited || !self->isstarted || !s_lcd_lvgl_bridged ||
        !lv_is_initialized() || (s_lcd_lvgl_display == NULL) ||
        (lv_display_get_default() != s_lcd_lvgl_display) ||
        (g_display0_cfg.input[0].format != DISPLAY_IN_FORMAT_16BITS_RGB565) ||
        (g_display0_cfg.input[0].p_base == NULL) ||
        (g_display0_cfg.input[0].hstride < screen_w) ||
        (s_lcd_scroll_blit.pending != 0U) ||
        (x < 0) || (y < 0) || (w <= 0) || (h <= 0) || (dy == 0) ||
        (dy <= -h) || (dy >= h) ||
        ((uint32_t)w > screen_w) || ((uint32_t)h > screen_h) ||
        ((uint32_t)x > screen_w - (uint32_t)w) ||
        ((uint32_t)y > screen_h - (uint32_t)h)) {
        return mp_const_false;
    }

    s_lcd_scroll_blit.x = x;
    s_lcd_scroll_blit.y = y;
    s_lcd_scroll_blit.w = w;
    s_lcd_scroll_blit.h = h;
    s_lcd_scroll_blit.dy = dy;
    __DMB();
    s_lcd_scroll_blit.pending = 1U;
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_scroll_rect_obj, 6, 6,
    lcd_scroll_rect);

// render_debug([reset]) -> (last_us, max_us, frame_crossings, line_pulses,
//                           render_count, last_inv_requests, max_inv_requests,
//                           full_inv_requests, vsync_timeouts)
// frame_crossings must stay zero: a non-zero value means a render ran into the next
// GLCDC line-detect pulse while the controller was scanning the same framebuffer.
STATIC mp_obj_t lcd_render_debug(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    mp_obj_t t[9] = {
        mp_obj_new_int_from_uint(s_lcd_render_last_us),
        mp_obj_new_int_from_uint(s_lcd_render_max_us),
        mp_obj_new_int_from_uint(s_lcd_render_crossed_frames),
        mp_obj_new_int_from_uint(lcd_vsync_counter),
        mp_obj_new_int_from_uint(s_lcd_render_count),
        mp_obj_new_int_from_uint(s_lcd_render_inv_count),
        mp_obj_new_int_from_uint(s_lcd_render_max_inv_count),
        mp_obj_new_int_from_uint(s_lcd_render_full_inv_request_count),
        mp_obj_new_int_from_uint(s_lcd_vsync_timeouts),
    };
    mp_obj_t result = mp_obj_new_tuple(MP_ARRAY_SIZE(t), t);
    if ((n_args > 1U) && mp_obj_is_true(args[1])) {
        s_lcd_render_last_us = 0U;
        s_lcd_render_max_us = 0U;
        s_lcd_render_crossed_frames = 0U;
        s_lcd_render_count = 0U;
        s_lcd_inv_since_render = 0U;
        s_lcd_render_inv_count = 0U;
        s_lcd_render_max_inv_count = 0U;
        s_lcd_render_full_inv_request_count = 0U;
        s_lcd_vsync_timeouts = 0U;
    }
    return result;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_render_debug_obj, 1, 2,
    lcd_render_debug);

// lvgl_setup() -- create the LVGL display + pointer indev in C with C callbacks, so no
// Python wrapper is allocated per frame or per input poll. Call once after lv.init().
// Returns True if the C bridge was installed (idempotent). pRGB uses it when present and
// keeps its Python callbacks only as a fallback for firmware without this method.
STATIC mp_obj_t lcd_lvgl_setup(mp_obj_t self_in) {
    (void)self_in;
    if (s_lcd_lvgl_bridged) {
        return mp_const_true;
    }
    if (!lv_is_initialized()) {
        lv_init();
    }
    uint32_t w = g_display0_cfg.input[0].hsize;
    uint32_t h = g_display0_cfg.input[0].vsize;
    void *fb = g_display0_cfg.input[0].p_base;
    uint32_t sz = g_display0_cfg.input[0].hstride * g_display0_cfg.input[0].vsize *
        ((g_display0_cfg.input[0].format < DISPLAY_IN_FORMAT_16BITS_RGB565) ? 4U : 2U);

    lv_display_t *disp = lv_display_create(w, h);
    if (disp == NULL) {
        return mp_const_false;
    }
    lv_display_set_color_format(disp, LV_COLOR_FORMAT_RGB565);
    lv_display_set_flush_cb(disp, lcd_lv_flush_cb);
    lv_display_set_buffers(disp, fb, NULL, sz, LV_DISPLAY_RENDER_MODE_DIRECT);
    lv_display_add_event_cb(disp, lcd_lv_invalidate_area_cb, LV_EVENT_INVALIDATE_AREA, NULL);
    lv_display_add_event_cb(disp, lcd_lv_render_start_cb, LV_EVENT_RENDER_START, NULL);
    lv_display_add_event_cb(disp, lcd_lv_render_ready_cb, LV_EVENT_RENDER_READY, NULL);

    lv_indev_t *indev = lv_indev_create();
    lv_indev_set_type(indev, LV_INDEV_TYPE_POINTER);
    lv_indev_set_display(indev, disp);
    lv_indev_set_read_cb(indev, lcd_lv_indev_read_cb);

    memset(&s_lcd_scroll_blit, 0, sizeof(s_lcd_scroll_blit));
    s_lcd_render_count = 0U;
    s_lcd_inv_since_render = 0U;
    s_lcd_render_inv_count = 0U;
    s_lcd_render_max_inv_count = 0U;
    s_lcd_render_full_inv_request_count = 0U;
    s_lcd_vsync_timeouts = 0U;
    s_lcd_lvgl_display = disp;
    s_lcd_lvgl_bridged = 1;
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_lvgl_setup_obj, lcd_lvgl_setup);

